mspm0-rs/mspm0-data-sources/svd/MSPM0G321X.svd
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x4</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>DTSEG2</name>
                                <description>Data Time Segment After Sample Point. Valid values are 0 to 15. The actual interpretation by the hardware of this value is such that one more than the programmed value is used.
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'.</description>
                                <bitOffset>0x4</bitOffset>
                                <bitWidth>0x4</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>DTSEG1</name>
                                <description>Data Time Segment Before Sample Point. Valid values are 0 to 31. The actual interpretation by the hardware of this value is such that one more than the programmed value is used.
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'.</description>
                                <bitOffset>0x8</bitOffset>
                                <bitWidth>0x5</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>DBRP</name>
                                <description>Data Bit Rate Prescaler. The value by which the oscillator frequency is divided for generating the bit time quanta. The bit time is built up from a multiple of this quanta. Valid values for the Bit Rate Prescaler are 0 to 31. The actual interpretation by the hardware of this value is such that one more than the value programmed here is used.
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'.</description>
                                <bitOffset>0x10</bitOffset>
                                <bitWidth>0x5</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TDC</name>
                                <description>Transmitter Delay Compensation
  0  Transmitter Delay Compensation disabled
  1  Transmitter Delay Compensation enabled</description>
                                <bitOffset>0x17</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>CANFD0_MCAN_TEST</name>
                        <description>MCAN Test Register</description>
                        <addressOffset>0x10</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffff7f</resetMask>
                        <fields>
                            <field>
                                <name>LBCK</name>
                                <description>Loop Back Mode. Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'.</description>
                                <bitOffset>0x4</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLE</name>
                                            <description>Reset value, Loop Back Mode is disabled</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ENABLE</name>
                                            <description>Loop Back Mode is enabled</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>TX</name>
                                <description>Control of Transmit Pin
  00  CAN TX pin controlled by the CAN Core, updated at the end of the CAN bit time
  01  Sample Point can be monitored at CAN TX pin
  10  Dominant ('0') level at CAN TX pin
  11  Recessive ('1') at CAN TX pin
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'.</description>
                                <bitOffset>0x5</bitOffset>
                                <bitWidth>0x2</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>RX</name>
                                <description>Receive Pin. Monitors the actual value of the CAN receive pin.</description>
                                <bitOffset>0x7</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DOMINANT</name>
                                            <description>The CAN bus is dominant (CAN RX pin = '0')</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>RECESSIVE</name>
                                            <description>The CAN bus is recessive (CAN RX pin = '1')</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>CANFD0_MCAN_RWD</name>
                        <description>MCAN RAM Watchdog</description>
                        <addressOffset>0x14</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>WDC</name>
                                <description>Watchdog Configuration. Start value of the Message RAM Watchdog Counter. With the reset value of &amp;quot;00&amp;quot; the counter is disabled.
 
