mspm0-rs/mspm0-data-sources/svd/MSPM0G321X.svd
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'.</description>
                                <bitOffset>0x10</bitOffset>
                                <bitWidth>0x9</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>NSJW</name>
                                <description>Nominal (Re)Synchronization Jump Width. Valid values are 0 to 127. The actual interpretation by the hardware of this value is such that one more than the value programmed here is used.
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'.</description>
                                <bitOffset>0x19</bitOffset>
                                <bitWidth>0x7</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>CANFD0_MCAN_TSCC</name>
                        <description>MCAN Timestamp Counter Configuration</description>
                        <addressOffset>0x20</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>TSS</name>
                                <description>Timestamp Select
  00  Timestamp counter value always 0x0000
  01  Timestamp counter value incremented according to TCP
  10  External timestamp counter value used
  11  Same as &amp;quot;00&amp;quot;
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x2</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TCP</name>
                                <description>Timestamp Counter Prescaler. Configures the timestamp and timeout counters time unit in multiples of CAN bit times. Valid values are 0 to 15. The actual interpretation by the hardware of this value is such that one more than the value programmed here is used.
 
Note: With CAN FD an external counter is required for timestamp generation (TSS = &amp;quot;10&amp;quot;).
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'.</description>
                                <bitOffset>0x10</bitOffset>
                                <bitWidth>0x4</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>CANFD0_MCAN_TSCV</name>
                        <description>MCAN Timestamp Counter Value</description>
                        <addressOffset>0x24</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>TSC</name>
                                <description>Timestamp Counter. The internal/external Timestamp Counter value is captured on start of frame (both Rx and Tx). When TSCC.TSS = &amp;quot;01&amp;quot;, the Timestamp Counter is incremented in multiples of CAN bit times, (1...16), depending on the configuration of TSCC.TCP. A wrap around sets interrupt flag IR.TSW. Write access resets the counter to zero. When TSCC.TSS = &amp;quot;10&amp;quot;, TSC reflects the External Timestamp Counter value, and a write access has no impact.
 
Note: A &amp;quot;wrap around&amp;quot; is a change of the Timestamp Counter value from non-zero to zero not
caused by write access to MCAN_TSCV.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x10</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>CANFD0_MCAN_TOCC</name>
                        <description>MCAN Timeout Counter Configuration</description>
                        <addressOffset>0x28</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0xffff0000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>ETOC</name>
                                <description>Enable Timeout Counter
  0  Timeout Counter disabled
  1  Timeout Counter enabled
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TOS</name>
                                <description>Timeout Select. When operating in Continuous mode, a write to TOCV presets the counter to the value configured by TOCC.TOP and continues down-counting. When the Timeout Counter is controlled by one of the FIFOs, an empty FIFO presets the counter to the value configured by TOCC.TOP. Down-counting is started when the first FIFO element is stored.
  00  Continuous operation
  01  Timeout controlled by Tx Event FIFO
  10  Timeout controlled by Rx FIFO 0
  11  Timeout controlled by Rx FIFO 1
 
