mspm0-rs/mspm0-data-sources/svd/MSPM0G321X.svd
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x7</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TDCO</name>
                                <description>Transmitter Delay Compensation Offset. Offset value defining the distance between the measured delay from the internal CAN TX signal to the internal CAN RX signal and the secondary sample point. Valid values are 0 to 127 mtq.
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'.</description>
                                <bitOffset>0x8</bitOffset>
                                <bitWidth>0x7</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>CANFD0_MCAN_IR</name>
                        <description>MCAN Interrupt Register</description>
                        <addressOffset>0x50</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x80000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>RF0N</name>
                                <description>Rx FIFO 0 New Message
  0  No new message written to Rx FIFO 0
  1  New message written to Rx FIFO 0</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>RF0W</name>
                                <description>Rx FIFO 0 Watermark Reached
  0  Rx FIFO 0 fill level below watermark
  1  Rx FIFO 0 fill level reached watermark</description>
                                <bitOffset>0x1</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>RF0F</name>
                                <description>Rx FIFO 0 Full
  0  Rx FIFO 0 not full
  1  Rx FIFO 0 full</description>
                                <bitOffset>0x2</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>RF0L</name>
                                <description>Rx FIFO 0 Message Lost
  0  No Rx FIFO 0 message lost
  1  Rx FIFO 0 message lost, also set after write attempt to Rx FIFO 0 of size zero</description>
                                <bitOffset>0x3</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>RF1N</name>
                                <description>Rx FIFO 1 New Message
  0  No new message written to Rx FIFO 1
  1  New message written to Rx FIFO 1</description>
                                <bitOffset>0x4</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>RF1W</name>
                                <description>Rx FIFO 1 Watermark Reached
  0  Rx FIFO 1 fill level below watermark
  1  Rx FIFO 1 fill level reached watermark</description>
                                <bitOffset>0x5</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>RF1F</name>
                                <description>Rx FIFO 1 Full
  0  Rx FIFO 1 not full
  1  Rx FIFO 1 full</description>
                                <bitOffset>0x6</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>RF1L</name>
                                <description>Rx FIFO 1 Message Lost
  0  No Rx FIFO 1 message lost
  1  Rx FIFO 1 message lost, also set after write attempt to Rx FIFO 1 of size zero</description>
                                <bitOffset>0x7</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>HPM</name>
                                <description>High Priority Message
  0  No high priority message received
  1  High priority message received</description>
                                <bitOffset>0x8</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TC</name>
                                <description>Transmission Completed
  0  No transmission completed
  1  Transmission completed</description>
                                <bitOffset>0x9</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TCF</name>
                                <description>Transmission Cancellation Finished
  0  No transmission cancellation finished
  1  Transmission cancellation finished</description>
                                <bitOffset>0xA</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TFE</name>
                                <description>Tx FIFO Empty
  0  Tx FIFO non-empty
  1  Tx FIFO empty</description>
                                <bitOffset>0xB</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TEFN</name>
                                <description>Tx Event FIFO New Entry
  0  Tx Event FIFO unchanged
  1  Tx Handler wrote Tx Event FIFO element</description>
                                <bitOffset>0xC</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TEFW</name>
                                <description>Tx Event FIFO Watermark Reached
  0  Tx Event FIFO fill level below watermark
  1  Tx Event FIFO fill level reached watermark</description>
                                <bitOffset>0xD</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TEFF</name>
                                <description>Tx Event FIFO Full
  0  Tx Event FIFO not full
  1  Tx Event FIFO full</description>
                                <bitOffset>0xE</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TEFL</name>
                                <description>Tx Event FIFO Element Lost
  0  No Tx Event FIFO element lost
  1  Tx Event FIFO element lost, also set after write attempt to Tx Event FIFO of size zero</description>
                                <bitOffset>0xF</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TSW</name>
                                <description>Timestamp Wraparound
  0  No timestamp counter wrap-around
  1  Timestamp counter wrapped around</description>
                                <bitOffset>0x10</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>MRAF</name>
                                <description>Message RAM Access Failure.  The flag is set, when the Rx Handler:
  - has not completed acceptance filtering or storage of an accepted message until the arbitration field of the following message has been received. In this case acceptance filtering or message storage is aborted and the Rx Handler starts processing of the following message.
  - was not able to write a message to the Message RAM. In this case message storage is aborted.
 
In both cases the FIFO put index is not updated resp. the New Data flag for a dedicated Rx Buffer is not set, a partly stored message is overwritten when the next message is stored to this location.
 
The flag is also set when the Tx Handler was not able to read a message from the Message RAM in time. In this case message transmission is aborted. In case of a Tx Handler access failure the MCAN is switched into Restricted Operation Mode. To leave Restricted Operation Mode, the Host CPU has to reset CCCR.ASM.
  0  No Message RAM access failure occurred
  1  Message RAM access failure occurred</description>
                                <bitOffset>0x11</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TOO</name>
                                <description>Timeout Occurred
  0  No timeout
  1  Timeout reached</description>
                                <bitOffset>0x12</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>DRX</name>
                                <description>Message Stored to Dedicated Rx Buffer. The flag is set whenever a received message has been stored into a dedicated Rx Buffer.
  0  No Rx Buffer updated
  1  At least one received message stored into an Rx Buffer</description>
                                <bitOffset>0x13</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>BEU</name>
                                <description>Bit Error Uncorrected. Message RAM bit error detected, uncorrected. This bit is set when a double bit error is detected by the ECC aggregator attached to the Message RAM. An uncorrected Message RAM bit error sets CCCR.INIT to '1'. This is done to avoid transmission of corrupted data.
  0  No bit error detected when reading from Message RAM
  1  Bit error detected, uncorrected (e.g. parity logic)</description>
                                <bitOffset>0x15</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ELO</name>
                                <description>Error Logging Overflow
  0  CAN Error Logging Counter did not overflow
  1  Overflow of CAN Error Logging Counter occurred</description>
                                <bitOffset>0x16</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>EP</name>
                                <description>Error Passive
  0  Error_Passive status unchanged
  1  Error_Passive status changed</description>
                                <bitOffset>0x17</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>EW</name>
                                <description>Warning Status
  0  Error_Warning status unchanged
  1  Error_Warning status changed</description>
                                <bitOffset>0x18</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>BO</name>
                                <description>Bus_Off Status
  0  Bus_Off status unchanged
  1  Bus_Off status changed</description>
                                <bitOffset>0x19</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>WDI</name>
                                <description>Watchdog Interrupt
  0  No Message RAM Watchdog event occurred
  1  Message RAM Watchdog event due to missing READY</description>
                                <bitOffset>0x1A</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>PEA</name>
                                <description>Protocol Error in Arbitration Phase (Nominal Bit Time is used)
  0  No protocol error in arbitration phase
  1  Protocol error in arbitration phase detected (PSR.LEC ? 0,7)</description>
                                <bitOffset>0x1B</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>PED</name>
                                <description>Protocol Error in Data Phase (Data Bit Time is used)
  0  No protocol error in data phase
  1  Protocol error in data phase detected (PSR.DLEC ? 0,7)</description>
                                <bitOffset>0x1C</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ARA</name>
                                <description>Access to Reserved Address
  0  No access to reserved address occurred
  1  Access to reserved address occurred</description>
                                <bitOffset>0x1D</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
