mspm0-rs/mspm0-data-sources/svd/MSPM0G321X.svd
A separate interrupt line reserved for corrected bit errors is provided via the MCAN_ERROR_REGS. It advised for the user to use these registers and leave the MCAN_IE.BECE bit cleared to '0' (disabled), thereby relegating this bit to not applicable.</description>
                                <bitOffset>0x14</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>BEUL</name>
                                <description>Bit Error Uncorrected Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1</description>
                                <bitOffset>0x15</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ELOL</name>
                                <description>Error Logging Overflow Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1</description>
                                <bitOffset>0x16</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>EPL</name>
                                <description>Error Passive Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1</description>
                                <bitOffset>0x17</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>EWL</name>
                                <description>Warning Status Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1</description>
                                <bitOffset>0x18</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>BOL</name>
                                <description>Bus_Off Status Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1</description>
                                <bitOffset>0x19</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>WDIL</name>
                                <description>Watchdog Interrupt Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1</description>
                                <bitOffset>0x1A</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>PEAL</name>
                                <description>Protocol Error in Arbitration Phase Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1</description>
                                <bitOffset>0x1B</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>PEDL</name>
                                <description>Protocol Error in Data Phase Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1</description>
                                <bitOffset>0x1C</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ARAL</name>
                                <description>Access to Reserved Address Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1</description>
                                <bitOffset>0x1D</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>CANFD0_MCAN_ILE</name>
                        <description>MCAN Interrupt Line Enable</description>
                        <addressOffset>0x5C</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>EINT0</name>
                                <description>Enable Interrupt Line 0
  0  Interrupt Line 0 is disabled
  1  Interrupt Line 0 is enabled</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>EINT1</name>
                                <description>Enable Interrupt Line 1
  0  Interrupt Line 1 is disabled
  1  Interrupt Line 1 is enabled</description>
                                <bitOffset>0x1</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>CANFD0_MCAN_GFC</name>
                        <description>MCAN Global Filter Configuration</description>
                        <addressOffset>0x80</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>RRFE</name>
                                <description>Reject Remote Frames Extended
  0  Filter remote frames with 29-bit extended IDs
  1  Reject all remote frames with 29-bit extended IDs
 
