mspm0-rs/mspm0-data-sources/svd/MSPM0G321X.svd
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>RRFS</name>
                                <description>Reject Remote Frames Standard
  0  Filter remote frames with 11-bit standard IDs
  1  Reject all remote frames with 11-bit standard IDs
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'.</description>
                                <bitOffset>0x1</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ANFE</name>
                                <description>Accept Non-matching Frames Extended. Defines how received messages with 29-bit IDs that do not match any element of the filter list are treated.
  00  Accept in Rx FIFO 0
  01  Accept in Rx FIFO 1
  10  Reject
  11  Reject
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'.</description>
                                <bitOffset>0x2</bitOffset>
                                <bitWidth>0x2</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>ANFS</name>
                                <description>Accept Non-matching Frames Standard. Defines how received messages with 11-bit IDs that do not match any element of the filter list are treated.
  00  Accept in Rx FIFO 0
  01  Accept in Rx FIFO 1
  10  Reject
  11  Reject
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'.</description>
                                <bitOffset>0x4</bitOffset>
                                <bitWidth>0x2</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>CANFD0_MCAN_SIDFC</name>
                        <description>MCAN Standard ID Filter Configuration</description>
                        <addressOffset>0x84</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>FLSSA</name>
                                <description>Filter List Standard Start Address. Start address of standard Message ID filter list (32-bit word address).</description>
                                <bitOffset>0x2</bitOffset>
                                <bitWidth>0xE</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>LSS</name>
                                <description>List Size Standard
  0        No standard Message ID filter
  1-128  Number of standard Message ID filter elements
  &gt;128   Values greater than 128 are interpreted as 128</description>
                                <bitOffset>0x10</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>CANFD0_MCAN_XIDFC</name>
                        <description>MCAN Extended ID Filter Configuration</description>
                        <addressOffset>0x88</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>FLESA</name>
                                <description>List Size Extended
  0     No extended Message ID filter
  1-64 Number of extended Message ID filter elements
  &gt;64  Values greater than 64 are interpreted as 64
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'.</description>
                                <bitOffset>0x2</bitOffset>
                                <bitWidth>0xE</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>LSE</name>
                                <description>Filter List Extended Start Address. Start address of extended Message ID filter list (32-bit word address).
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'.</description>
                                <bitOffset>0x10</bitOffset>
                                <bitWidth>0x7</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>CANFD0_MCAN_XIDAM</name>
                        <description>MCAN Extended ID and Mask</description>
                        <addressOffset>0x90</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x1fffffff</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>EIDM</name>
                                <description>Extended ID Mask. For acceptance filtering of extended frames the Extended ID AND Mask is ANDed with the Message ID of a received frame. Intended for masking of 29-bit IDs in SAE J1939. With the reset value of all bits set to one the mask is not active.
 
