mspm0-rs/mspm0-data-sources/svd/MSPM0G321X.svd
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'.</description>
                                <bitOffset>0x2</bitOffset>
                                <bitWidth>0xE</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>F0S</name>
                                <description>Rx FIFO 0 Size. The Rx FIFO 0 elements are indexed from 0 to F0S-1.
  0      No Rx FIFO 0
  1-64  Number of Rx FIFO 0 elements
  &gt;64   Values greater than 64 are interpreted as 64
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'.</description>
                                <bitOffset>0x10</bitOffset>
                                <bitWidth>0x7</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>F0WM</name>
                                <description>Rx FIFO 0 Watermark
  0      Watermark interrupt disabled
  1-64  Level for Rx FIFO 0 watermark interrupt (IR.RF0W)
  &gt;64   Watermark interrupt disabled
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'.</description>
                                <bitOffset>0x18</bitOffset>
                                <bitWidth>0x7</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>F0OM</name>
                                <description>FIFO 0 Operation Mode. FIFO 0 can be operated in blocking or in overwrite mode.
  0  FIFO 0 blocking mode
  1  FIFO 0 overwrite mode
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'.</description>
                                <bitOffset>0x1F</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>CANFD0_MCAN_RXF0S</name>
                        <description>MCAN Rx FIFO 0 Status</description>
                        <addressOffset>0xA4</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>F0FL</name>
                                <description>Rx FIFO 0 Fill Level. Number of elements stored in Rx FIFO 0, range 0 to 64.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x7</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>F0GI</name>
                                <description>Rx FIFO 0 Get Index. Rx FIFO 0 read index pointer, range 0 to 63.</description>
                                <bitOffset>0x8</bitOffset>
                                <bitWidth>0x6</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>F0PI</name>
                                <description>Rx FIFO 0 Put Index. Rx FIFO 0 write index pointer, range 0 to 63.</description>
                                <bitOffset>0x10</bitOffset>
                                <bitWidth>0x6</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>F0F</name>
                                <description>Rx FIFO 0 Full
  0  Rx FIFO 0 not full
  1  Rx FIFO 0 full</description>
                                <bitOffset>0x18</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>RF0L</name>
                                <description>Rx FIFO 0 Message Lost. This bit is a copy of interrupt flag IR.RF0L. When IR.RF0L is reset, this bit is also reset.
  0  No Rx FIFO 0 message lost
  1  Rx FIFO 0 message lost, also set after write attempt to Rx FIFO 0 of size zero
 
Note: Overwriting the oldest message when RXF0C.F0OM = '1' will not set this flag.</description>
                                <bitOffset>0x19</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>CANFD0_MCAN_RXF0A</name>
                        <description>MCAN Rx FIFO 0 Acknowledge</description>
                        <addressOffset>0xA8</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>F0AI</name>
                                <description>Rx FIFO 0 Acknowledge Index. After the Host has read a message or a sequence of messages from Rx FIFO 0 it has to write the buffer index of the last element read from Rx FIFO 0 to F0AI. This will set the Rx FIFO 0 Get Index RXF0S.F0GI to F0AI + 1 and update the FIFO 0 Fill Level RXF0S.F0FL.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x6</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>CANFD0_MCAN_RXBC</name>
                        <description>MCAN Rx Buffer Configuration</description>
                        <addressOffset>0xAC</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>RBSA</name>
                                <description>Rx Buffer Start Address. Configures the start address of the Rx Buffers section in the Message RAM (32-bit word address).
 
+I466</description>
                                <bitOffset>0x2</bitOffset>
                                <bitWidth>0xE</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>CANFD0_MCAN_RXF1C</name>
                        <description>MCAN Rx FIFO 1 Configuration</description>
                        <addressOffset>0xB0</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>F1SA</name>
                                <description>Rx FIFO 1 Start Address Start address of Rx FIFO 1 in Message RAM (32-bit word address).</description>
                                <bitOffset>0x2</bitOffset>
                                <bitWidth>0xE</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>F1S</name>
                                <description>Rx FIFO 1 Size. The Rx FIFO 1 elements are indexed from 0 to F1S - 1.
  0      No Rx FIFO 1
  1-64  Number of Rx FIFO 1 elements
  &gt;64   Values greater than 64 are interpreted as 64
 
