mspm0-rs/mspm0-data-sources/svd/MSPM0G321X.svd
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x3</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>F1DS</name>
                                <description>Rx FIFO 1 Data Field Size
  000  8 byte data field
  001  12 byte data field
  010  16 byte data field
  011  20 byte data field
  100  24 byte data field
  101  32 byte data field
  110  48 byte data field
  111  64 byte data field
 
Note: In case the data field size of an accepted CAN frame exceeds the data field size configured for the matching Rx Buffer or Rx FIFO, only the number of bytes as configured by RXESC are stored to the Rx Buffer resp. Rx FIFO element. The rest of the frame's data field is ignored.
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'.</description>
                                <bitOffset>0x4</bitOffset>
                                <bitWidth>0x3</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>RBDS</name>
                                <description>Rx Buffer Data Field Size
  000  8 byte data field
  001  12 byte data field
  010  16 byte data field
  011  20 byte data field
  100  24 byte data field
  101  32 byte data field
  110  48 byte data field
  111  64 byte data field
 
Note: In case the data field size of an accepted CAN frame exceeds the data field size configured for the matching Rx Buffer or Rx FIFO, only the number of bytes as configured by RXESC are stored to the Rx Buffer resp. Rx FIFO element. The rest of the frame's data field is ignored.
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'.</description>
                                <bitOffset>0x8</bitOffset>
                                <bitWidth>0x3</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>CANFD0_MCAN_TXBC</name>
                        <description>MCAN Tx Buffer Configuration</description>
                        <addressOffset>0xC0</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>TBSA</name>
                                <description>Tx Buffers Start Address. Start address of Tx Buffers section in Message RAM (32-bit word address).
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'.</description>
                                <bitOffset>0x2</bitOffset>
                                <bitWidth>0xE</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>NDTB</name>
                                <description>Number of Dedicated Transmit Buffers
  0      No Dedicated Tx Buffers
  1-32  Number of Dedicated Tx Buffers
  &gt;32   Values greater than 32 are interpreted as 32
 
Note: Be aware that the sum of TFQS and NDTB may be not greater than 32. There is no check
for erroneous configurations. The Tx Buffers section in the Message RAM starts with the
dedicated Tx Buffers.
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'.</description>
                                <bitOffset>0x10</bitOffset>
                                <bitWidth>0x6</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TFQS</name>
                                <description>Transmit FIFO/Queue Size
  0      No Tx FIFO/Queue
  1-32  Number of Tx Buffers used for Tx FIFO/Queue
  &gt;32   Values greater than 32 are interpreted as 32
 
Note: Be aware that the sum of TFQS and NDTB may be not greater than 32. There is no check
for erroneous configurations. The Tx Buffers section in the Message RAM starts with the
dedicated Tx Buffers.
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'.</description>
                                <bitOffset>0x18</bitOffset>
                                <bitWidth>0x6</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>TFQM</name>
                                <description>Tx FIFO/Queue Mode
  0  Tx FIFO operation
  1  Tx Queue operation
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'.</description>
                                <bitOffset>0x1E</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>CANFD0_MCAN_TXFQS</name>
                        <description>MCAN Tx FIFO / Queue Status</description>
                        <addressOffset>0xC4</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>TFFL</name>
                                <description>Tx FIFO Free Level.  Number of consecutive free Tx FIFO elements starting from TFGI, range 0 to 32. Read as zero when Tx Queue operation is configured (TXBC.TFQM = '1').</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x6</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TFGI</name>
                                <description>Tx FIFO Get Index. Tx FIFO read index pointer, range 0 to 31. Read as zero when Tx Queue operation is configured (TXBC.TFQM = '1').
 
