mspm0-rs/mspm0-data-sources/svd/MSPM0G321X.svd
Each Tx Buffer has its own Transmission Occurred bit. The bits are set when the corresponding TXBRP bit is cleared after a successful transmission. The bits are reset when a new transmission is requested by writing a '1' to the corresponding bit of register TXBAR.
  0  No transmission occurred
  1  Transmission occurred</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TO1</name>
                                <description>Transmission Occurred 1. See description for bit 0.</description>
                                <bitOffset>0x1</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TO2</name>
                                <description>Transmission Occurred 2. See description for bit 0.</description>
                                <bitOffset>0x2</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TO3</name>
                                <description>Transmission Occurred 3. See description for bit 0.</description>
                                <bitOffset>0x3</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TO4</name>
                                <description>Transmission Occurred 4. See description for bit 0.</description>
                                <bitOffset>0x4</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TO5</name>
                                <description>Transmission Occurred 5. See description for bit 0.</description>
                                <bitOffset>0x5</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TO6</name>
                                <description>Transmission Occurred 6. See description for bit 0.</description>
                                <bitOffset>0x6</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TO7</name>
                                <description>Transmission Occurred 7. See description for bit 0.</description>
                                <bitOffset>0x7</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TO8</name>
                                <description>Transmission Occurred 8. See description for bit 0.</description>
                                <bitOffset>0x8</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TO9</name>
                                <description>Transmission Occurred 9. See description for bit 0.</description>
                                <bitOffset>0x9</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TO10</name>
                                <description>Transmission Occurred 10. See description for bit 0.</description>
                                <bitOffset>0xA</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TO11</name>
                                <description>Transmission Occurred 11. See description for bit 0.</description>
                                <bitOffset>0xB</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TO12</name>
                                <description>Transmission Occurred 12. See description for bit 0.</description>
                                <bitOffset>0xC</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TO13</name>
                                <description>Transmission Occurred 13. See description for bit 0.</description>
                                <bitOffset>0xD</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TO14</name>
                                <description>Transmission Occurred 14. See description for bit 0.</description>
                                <bitOffset>0xE</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TO15</name>
                                <description>Transmission Occurred 15. See description for bit 0.</description>
                                <bitOffset>0xF</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TO16</name>
                                <description>Transmission Occurred 16. See description for bit 0.</description>
                                <bitOffset>0x10</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TO17</name>
                                <description>Transmission Occurred 17. See description for bit 0.</description>
                                <bitOffset>0x11</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TO18</name>
                                <description>Transmission Occurred 18. See description for bit 0.</description>
                                <bitOffset>0x12</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TO19</name>
                                <description>Transmission Occurred 19. See description for bit 0.</description>
                                <bitOffset>0x13</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TO20</name>
                                <description>Transmission Occurred 20. See description for bit 0.</description>
                                <bitOffset>0x14</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TO21</name>
                                <description>Transmission Occurred 21. See description for bit 0.</description>
                                <bitOffset>0x15</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TO22</name>
                                <description>Transmission Occurred 22. See description for bit 0.</description>
                                <bitOffset>0x16</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TO23</name>
                                <description>Transmission Occurred 23. See description for bit 0.</description>
                                <bitOffset>0x17</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TO24</name>
                                <description>Transmission Occurred 24. See description for bit 0.</description>
                                <bitOffset>0x18</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TO25</name>
                                <description>Transmission Occurred 25. See description for bit 0.</description>
                                <bitOffset>0x19</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TO26</name>
                                <description>Transmission Occurred 26. See description for bit 0.</description>
                                <bitOffset>0x1A</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TO27</name>
                                <description>Transmission Occurred 27. See description for bit 0.</description>
                                <bitOffset>0x1B</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TO28</name>
                                <description>Transmission Occurred 28. See description for bit 0.</description>
                                <bitOffset>0x1C</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TO29</name>
                                <description>Transmission Occurred 29. See description for bit 0.</description>
                                <bitOffset>0x1D</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TO30</name>
                                <description>Transmission Occurred 30. See description for bit 0.</description>
                                <bitOffset>0x1E</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                            <field>
                                <name>TO31</name>
                                <description>Transmission Occurred 31. See description for bit 0.</description>
                                <bitOffset>0x1F</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>CANFD0_MCAN_TXBCF</name>
                        <description>MCAN Tx Buffer Cancellation Finished</description>
                        <addressOffset>0xDC</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>CF0</name>
                                <description>Cancellation Finished 0.
 
