mspm0-rs/mspm0-data-sources/svd/MSPM0G321X.svd
                            <register>
                                <name>CANFD0_MIS</name>
                                <description>Masked interrupt status</description>
                                <addressOffset>0x18</addressOffset>
                                <size>32</size>
                                <access>read-only</access>
                                <resetValue>0x00000000</resetValue>
                                <fields>
                                    <field>
                                        <name>INTL0</name>
                                        <description>Masked MCAN Interrupt Line 0.</description>
                                        <bitOffset>0x0</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <enumeratedValues>
                                                <enumeratedValue>
                                                    <name>CLR</name>
                                                    <description>Interrupt did not occur</description>
                                                    <value>0x0</value>
                                                </enumeratedValue>
                                                <enumeratedValue>
                                                    <name>SET</name>
                                                    <description>Interrupt occured</description>
                                                    <value>0x1</value>
                                                </enumeratedValue>
                                            </enumeratedValues>
                                        </field>
                                    <field>
                                        <name>INTL1</name>
                                        <description>Masked MCAN Interrupt Line 1.</description>
                                        <bitOffset>0x1</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <enumeratedValues>
                                                <enumeratedValue>
                                                    <name>CLR</name>
                                                    <description>Interrupt did not occur</description>
                                                    <value>0x0</value>
                                                </enumeratedValue>
                                                <enumeratedValue>
                                                    <name>SET</name>
                                                    <description>Interrupt occured</description>
                                                    <value>0x1</value>
                                                </enumeratedValue>
                                            </enumeratedValues>
                                        </field>
                                    <field>
                                        <name>SEC</name>
                                        <description>Masked Message RAM SEC interrupt.</description>
                                        <bitOffset>0x2</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <enumeratedValues>
                                                <enumeratedValue>
                                                    <name>CLR</name>
                                                    <description>Interrupt did not occur</description>
                                                    <value>0x0</value>
                                                </enumeratedValue>
                                                <enumeratedValue>
                                                    <name>SET</name>
                                                    <description>Interrupt occured</description>
                                                    <value>0x1</value>
                                                </enumeratedValue>
                                            </enumeratedValues>
                                        </field>
                                    <field>
                                        <name>DED</name>
                                        <description>Masked Message RAM DED interrupt.</description>
                                        <bitOffset>0x3</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <enumeratedValues>
                                                <enumeratedValue>
                                                    <name>CLR</name>
                                                    <description>Interrupt did not occur</description>
                                                    <value>0x0</value>
                                                </enumeratedValue>
                                                <enumeratedValue>
                                                    <name>SET</name>
                                                    <description>Interrupt occured</description>
                                                    <value>0x1</value>
                                                </enumeratedValue>
                                            </enumeratedValues>
                                        </field>
                                    <field>
                                        <name>EXT_TS_CNTR_OVFL</name>
                                        <description>Masked External Timestamp Counter Overflow interrupt.</description>
                                        <bitOffset>0x4</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <enumeratedValues>
                                                <enumeratedValue>
                                                    <name>CLR</name>
                                                    <description>Interrupt did not occur</description>
                                                    <value>0x0</value>
                                                </enumeratedValue>
                                                <enumeratedValue>
                                                    <name>SET</name>
                                                    <description>Interrupt occured</description>
                                                    <value>0x1</value>
                                                </enumeratedValue>
                                            </enumeratedValues>
                                        </field>
                                    <field>
                                        <name>WAKEUP</name>
                                        <description>Masked Clock Stop Wake Up interrupt.</description>
                                        <bitOffset>0x5</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <enumeratedValues>
                                                <enumeratedValue>
                                                    <name>CLR</name>
                                                    <description>Interrupt did not occur</description>
                                                    <value>0x0</value>
                                                </enumeratedValue>
                                                <enumeratedValue>
                                                    <name>SET</name>
                                                    <description>Interrupt occured</description>
                                                    <value>0x1</value>
                                                </enumeratedValue>
                                            </enumeratedValues>
                                        </field>
                                </fields>
                            </register>
                            <register>
                                <name>CANFD0_ISET</name>
                                <description>Interrupt set</description>
                                <addressOffset>0x20</addressOffset>
                                <size>32</size>
                                <access>write-only</access>
                                <resetValue>0x00000000</resetValue>
                                <fields>
                                    <field>
                                        <name>INTL0</name>
                                        <description>Set MCAN Interrupt Line 0.</description>
                                        <bitOffset>0x0</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <enumeratedValues>
                                                <enumeratedValue>
                                                    <name>NO_EFFECT</name>
                                                    <description>Writing 0 has no effect</description>
                                                    <value>0x0</value>
                                                </enumeratedValue>
                                                <enumeratedValue>
                                                    <name>SET</name>
                                                    <description>Set Interrupt</description>
                                                    <value>0x1</value>
                                                </enumeratedValue>
                                            </enumeratedValues>
                                        </field>
                                    <field>
                                        <name>INTL1</name>
                                        <description>Set MCAN Interrupt Line 1.</description>
                                        <bitOffset>0x1</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <enumeratedValues>
                                                <enumeratedValue>
                                                    <name>NO_EFFECT</name>
                                                    <description>Writing 0 has no effect</description>
                                                    <value>0x0</value>
                                                </enumeratedValue>
                                                <enumeratedValue>
                                                    <name>SET</name>
                                                    <description>Set Interrupt</description>
                                                    <value>0x1</value>
                                                </enumeratedValue>
                                            </enumeratedValues>
                                        </field>
                                    <field>
                                        <name>SEC</name>
                                        <description>Set Message RAM SEC interrupt.</description>
                                        <bitOffset>0x2</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <enumeratedValues>
                                                <enumeratedValue>
                                                    <name>NO_EFFECT</name>
                                                    <description>Writing 0 has no effect</description>
                                                    <value>0x0</value>
                                                </enumeratedValue>
                                                <enumeratedValue>
                                                    <name>SET</name>
                                                    <description>Set Interrupt</description>
                                                    <value>0x1</value>
                                                </enumeratedValue>
                                            </enumeratedValues>
                                        </field>
                                    <field>
                                        <name>DED</name>
                                        <description>Set Message RAM DED interrupt.</description>
                                        <bitOffset>0x3</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <enumeratedValues>
                                                <enumeratedValue>
                                                    <name>NO_EFFECT</name>
                                                    <description>Writing 0 has no effect</description>
                                                    <value>0x0</value>
                                                </enumeratedValue>
                                                <enumeratedValue>
                                                    <name>SET</name>
                                                    <description>Set Interrupt</description>
                                                    <value>0x1</value>
                                                </enumeratedValue>
                                            </enumeratedValues>
                                        </field>
                                    <field>
                                        <name>EXT_TS_CNTR_OVFL</name>
                                        <description>Set External Timestamp Counter Overflow interrupt.</description>
                                        <bitOffset>0x4</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <enumeratedValues>
                                                <enumeratedValue>
                                                    <name>NO_EFFECT</name>
                                                    <description>Writing 0 has no effect</description>
                                                    <value>0x0</value>
                                                </enumeratedValue>
                                                <enumeratedValue>
                                                    <name>SET</name>
                                                    <description>Set Interrupt</description>
                                                    <value>0x1</value>
                                                </enumeratedValue>
                                            </enumeratedValues>
                                        </field>
                                    <field>
                                        <name>WAKEUP</name>
                                        <description>Set Clock Stop Wake Up interrupt.</description>
                                        <bitOffset>0x5</bitOffset>
                                        <bitWidth>0x1</bitWidth>
                                        <enumeratedValues>
                                                <enumeratedValue>
                                                    <name>NO_EFFECT</name>
                                                    <description>Writing 0 has no effect</description>
                                                    <value>0x0</value>
                                                </enumeratedValue>
                                                <enumeratedValue>
                                                    <name>SET</name>
                                                    <description>Set Interrupt</description>
                                                    <value>0x1</value>
                                                </enumeratedValue>
                                            </enumeratedValues>
                                        </field>
                                </fields>
                            </register>
