mspm0-rs/mspm0-data-sources/svd/MSPM0G321X.svd
                <register>
                    <name>MATHACL_CTL</name>
                    <description>Control Register</description>
                    <addressOffset>0x1100</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FUNC</name>
                            <description>ULP_ADCHP Enable Conversions.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x5</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NOP</name>
                                        <description>No operation</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SINCOS</name>
                                        <description>Sine and Cosine operation</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ATAN2</name>
                                        <description>Arc tangent with x and y values as operands.</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV</name>
                                        <description>Divide, the operands are numerator, denominator, and the divide type. Result is the quotient and reminder.</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SQRT</name>
                                        <description>Do square root. Operand is the number whoose square root needs to be computed. The number if outside the range needs to be scaled up down by  2 power 2n to bring it with in the range.</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MPY32</name>
                                        <description>32-bit Multiply Result</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SQUARE32</name>
                                        <description>32-bit square result</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MPY64</name>
                                        <description>64-bit multiply result</description>
                                        <value>0x8</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SQUARE64</name>
                                        <description>64-bit multiply result</description>
                                        <value>0x9</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MAC</name>
                                        <description>Multiply and accumulate operation</description>
                                        <value>0xA</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SAC</name>
                                        <description>Square and accumulate operation</description>
                                        <value>0xB</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>QVAL</name>
                            <description>Indicates the fractional bits in the operands, ranges from 0 to 31. Applicable to DIV function.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x5</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>Q0</name>
                                        <description>Q0 operands</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>Q1</name>
                                        <description>Q1 operands</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>Q2</name>
                                        <description>Q2 operands</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>Q3</name>
                                        <description>Q3 operands</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>Q4</name>
                                        <description>Q4 operands</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>Q5</name>
                                        <description>Q5 operands</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>Q6</name>
                                        <description>Q6 operands</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>Q7</name>
                                        <description>Q7 operands</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>Q8</name>
                                        <description>Q8 operands</description>
                                        <value>0x8</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>Q9</name>
                                        <description>Q9 operands</description>
                                        <value>0x9</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>Q10</name>
                                        <description>Q10 operands</description>
                                        <value>0xA</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>Q11</name>
                                        <description>Q11 operands</description>
                                        <value>0xB</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>Q12</name>
                                        <description>Q12 operands</description>
                                        <value>0xC</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>Q13</name>
                                        <description>Q13 operands</description>
                                        <value>0xD</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>Q14</name>
                                        <description>Q14 operands</description>
                                        <value>0xE</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>Q15</name>
                                        <description>Q15 operands</description>
                                        <value>0xF</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>Q16</name>
                                        <description>Q16 operands</description>
                                        <value>0x10</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>Q17</name>
                                        <description>Q17 operands</description>
                                        <value>0x11</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>Q18</name>
                                        <description>Q18 operands</description>
                                        <value>0x12</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>Q19</name>
                                        <description>Q19 operands</description>
                                        <value>0x13</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>Q20</name>
                                        <description>Q20 operands</description>
                                        <value>0x14</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>Q21</name>
                                        <description>Q21 operands</description>
                                        <value>0x15</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>Q22</name>
                                        <description>Q22 operands</description>
                                        <value>0x16</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>Q23</name>
                                        <description>Q23 operands</description>
                                        <value>0x17</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>Q24</name>
                                        <description>Q24 operands</description>
                                        <value>0x18</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>Q25</name>
                                        <description>Q25 operands</description>
                                        <value>0x19</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>Q26</name>
                                        <description>Q26 operands</description>
                                        <value>0x1A</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>Q27</name>
                                        <description>Q27 operands</description>
                                        <value>0x1B</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>Q28</name>
                                        <description>Q28 operands</description>
                                        <value>0x1C</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>Q29</name>
                                        <description>Q29 operands</description>
                                        <value>0x1D</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>Q30</name>
                                        <description>Q30 operands</description>
                                        <value>0x1E</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>Q31</name>
                                        <description>Q31 operands</description>
                                        <value>0x1F</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>OPTYPE</name>
                            <description>Operand type, could signed or unsigned. applicable to DIV function.</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>UNSIGNED</name>
                                        <description>Unsigned operands</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SIGNED</name>
                                        <description>Signed operands.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>NUMITER</name>
                            <description>Number of iterations, applicable if the function does the computations iteratively, for example sine/cosine/atan2/sqrt.
Note: A value of 0 is interpreted as 31.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x5</bitWidth>
                            </field>
                        <field>
                            <name>SFACTOR</name>
                            <description>Scaling factor. In case of SQRT function, the input operand needs to be in a range. If not it has to be scaled to 2^(+/-n). This field should be written with the value 'n'.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x6</bitWidth>
                            </field>
                        <field>
                            <name>SATEN</name>
                            <description>Saturation enable
This bit is shared among DIV, SQUARE32, MPY32, MAC and SAC functions.
When enabled, it will make the result to saturate to maximum value in case of an overflow event
When disabled, the result will overflow to an unknown value.</description>
                            <bitOffset>0x16</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Saturation is disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Saturation is enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>MATHACL_OP2</name>
                    <description>Operand 2 register.</description>
                    <addressOffset>0x1118</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>MATHACL_OP1</name>
                    <description>Operand 1 register.</description>
                    <addressOffset>0x111C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>MATHACL_RES1</name>
                    <description>Result 1 register.</description>
                    <addressOffset>0x1120</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>MATHACL_RES2</name>
                    <description>Result 2 register.</description>
                    <addressOffset>0x1124</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                    </fields>
                </register>
