mspm0-rs/mspm0-data-sources/svd/MSPM0G321X.svd
                    <register>
                        <name>TIMA1_CPU_INT_ISET</name>
                        <description>Interrupt set</description>
                        <addressOffset>0x20</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>Z</name>
                                <description>Zero event SET</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Writing 0 has no effect.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Event Set</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>L</name>
                                <description>Load event SET</description>
                                <bitOffset>0x1</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Writing 0 has no effect.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Event Set</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CCD0</name>
                                <description>Capture or compare down event SET</description>
                                <bitOffset>0x4</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Writing 0 has no effect.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Event Set</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CCD1</name>
                                <description>Capture or compare down event SET</description>
                                <bitOffset>0x5</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Writing 0 has no effect.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Event Set</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CCU0</name>
                                <description>Capture or compare up event SET</description>
                                <bitOffset>0x8</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Writing 0 has no effect.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Event Set</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CCU1</name>
                                <description>Capture or compare up event SET</description>
                                <bitOffset>0x9</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Writing 0 has no effect.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Event Set</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>F</name>
                                <description>Fault event SET</description>
                                <bitOffset>0x18</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Writing 0 has no effect.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Event Set</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>TOV</name>
                                <description>Trigger Overflow event SET</description>
                                <bitOffset>0x19</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Writing 0 has no effect.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Event Set</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CCD4</name>
                                <description>Compare down event 4 SET</description>
                                <bitOffset>0xC</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Writing 0 has no effect.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Event Set</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CCD5</name>
                                <description>Compare down event 5 SET</description>
                                <bitOffset>0xD</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Writing 0 has no effect.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Event Set</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CCU4</name>
                                <description>Compare up event 4 SET</description>
                                <bitOffset>0xE</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Writing 0 has no effect.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Event Set</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CCU5</name>
                                <description>Compare up event 5 SET</description>
                                <bitOffset>0xF</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Writing 0 has no effect.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Event Set</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
