mspm0-rs/mspm0-data-sources/svd/MSPM0G321X.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>FLASH</name>
            <groupName>FLASH</groupName>
            <version>1.0</version>
            <description>MEM</description>
            <baseAddress>0x0</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x40000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
            </registers>
        </peripheral>
        <peripheral>
            <name>CPUSS</name>
            <groupName>CPUSS</groupName>
            <version>1.0</version>
            <description>CPUSSMMR</description>
            <baseAddress>0x40400000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1F00</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CPUSS_EVT_MODE</name>
                    <description>Event Mode</description>
                    <addressOffset>0x10E0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>INT_CFG</name>
                            <description>Event line mode select</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>The interrupt or event line is disabled.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SOFTWARE</name>
                                        <description>Event handled by software. Software must clear the associated RIS flag.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>HARDWARE</name>
                                        <description>Event handled by hardware. The hardware (another module) clears automatically the associated RIS flag.</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>CPUSS_DESC</name>
                    <description>Module Description</description>
                    <addressOffset>0x10FC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>MINREV</name>
                            <description>Minor rev of the IP</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-only</access>
                            </field>
                        <field>
                            <name>MAJREV</name>
                            <description>Major rev of the IP</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-only</access>
                            </field>
                        <field>
                            <name>FEATUREVER</name>
                            <description>Feature Set for the module *instance*</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-only</access>
                            </field>
                        <field>
                            <name>MODULEID</name>
                            <description>Module identification contains a unique peripheral identification number. The assignments are maintained in a central database for all of the platform modules to ensure uniqueness.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            <access>read-only</access>
                            </field>
                    </fields>
                </register>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>44</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>CPUSS_CPU_INT_GROUP0[%s]</name>
                    <description></description>
                    <addressOffset>0x1100</addressOffset>
                    <register>
                        <name>CPUSS_CPU_INT_GROUP0_IIDX</name>
                        <description>Interrupt index</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>STAT</name>
                                <description>Interrupt index status</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-only</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_INTR</name>
                                            <description>No pending interrupt</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT0</name>
                                            <description>Interrupt 0</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT1</name>
                                            <description>Interrupt 1</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT2</name>
                                            <description>Interrupt 2</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT3</name>
                                            <description>Interrupt 3</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT4</name>
                                            <description>Interrupt 4</description>
                                            <value>0x5</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT5</name>
                                            <description>Interrupt 5</description>
                                            <value>0x6</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT6</name>
                                            <description>Interrupt 6</description>
                                            <value>0x7</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT7</name>
                                            <description>Interrupt 7</description>
                                            <value>0x8</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>CPUSS_CPU_INT_GROUP0_IMASK</name>
                        <description>Interrupt mask</description>
                        <addressOffset>0x8</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <resetValue>0x000000ff</resetValue>
                        <fields>
                            <field>
                                <name>INT</name>
                                <description>Masks the corresponding interrupt</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-only</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>INT0</name>
                                            <description>Interrupt 0</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT1</name>
                                            <description>Interrupt 1</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT2</name>
                                            <description>Interrupt 2</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT3</name>
                                            <description>Interrupt 3</description>
                                            <value>0x8</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT4</name>
                                            <description>Interrupt 4</description>
                                            <value>0x10</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT5</name>
                                            <description>Interrupt 5</description>
                                            <value>0x20</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT6</name>
                                            <description>Interrupt 6</description>
                                            <value>0x40</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT7</name>
                                            <description>Interrupt 7</description>
                                            <value>0x80</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>CPUSS_CPU_INT_GROUP0_RIS</name>
                        <description>Raw interrupt status</description>
                        <addressOffset>0x10</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>INT</name>
                                <description>Raw interrupt status for INT</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>INT0</name>
                                            <description>Interrupt 0</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT1</name>
                                            <description>Interrupt 1</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT2</name>
                                            <description>Interrupt 2</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT3</name>
                                            <description>Interrupt 3</description>
                                            <value>0x8</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT4</name>
                                            <description>Interrupt 4</description>
                                            <value>0x10</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT5</name>
                                            <description>Interrupt 5</description>
                                            <value>0x20</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT6</name>
                                            <description>Interrupt 6</description>
                                            <value>0x40</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT7</name>
                                            <description>Interrupt 7</description>
                                            <value>0x80</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>CPUSS_CPU_INT_GROUP0_MIS</name>
                        <description>Masked interrupt status</description>
                        <addressOffset>0x18</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>INT</name>
                                <description>Masked interrupt status for INT0</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>INT0</name>
                                            <description>Interrupt 0</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT1</name>
                                            <description>Interrupt 1</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT2</name>
                                            <description>Interrupt 2</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT3</name>
                                            <description>Interrupt 3</description>
                                            <value>0x8</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT4</name>
                                            <description>Interrupt 4</description>
                                            <value>0x10</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT5</name>
                                            <description>Interrupt 5</description>
                                            <value>0x20</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT6</name>
                                            <description>Interrupt 6</description>
                                            <value>0x40</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT7</name>
                                            <description>Interrupt 7</description>
                                            <value>0x80</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>CPUSS_CPU_INT_GROUP0_ISET</name>
                        <description>Interrupt set</description>
                        <addressOffset>0x20</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>INT</name>
                                <description>Sets INT in RIS register</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>INT0</name>
                                            <description>Interrupt 0</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT1</name>
                                            <description>Interrupt 1</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT2</name>
                                            <description>Interrupt 2</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT3</name>
                                            <description>Interrupt 3</description>
                                            <value>0x8</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT4</name>
                                            <description>Interrupt 4</description>
                                            <value>0x10</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT5</name>
                                            <description>Interrupt 5</description>
                                            <value>0x20</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT6</name>
                                            <description>Interrupt 6</description>
                                            <value>0x40</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT7</name>
                                            <description>Interrupt 7</description>
                                            <value>0x80</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
