mspm0-rs/mspm0-data-sources/svd/MSPM0G321X.svd
                <register>
                    <name>UC5_UART_LCRH</name>
                    <description>UART Line Control Register</description>
                    <addressOffset>0x1104</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>BRK</name>
                            <description>UART Send Break (for LIN Protocol)
1. Break condition is sent on the line for as long as this bit is set</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Normal operation</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>A low level is continually output on the UARTxTXD signal, after completing transmission of the current character. For the proper execution of the break command, software must set this bit for at least two frames (character periods).</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>PEN</name>
                            <description>UART Parity Enable</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Parity is disabled and no parity bit is added to the data frame.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Parity checking and generation is enabled.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>EPS</name>
                            <description>UART Even Parity Select  This bit has no effect when parity is disabled by the PEN bit.  For 9-Bit UART Mode transmissions, this bit controls the address byte and data byte indication (9th bit). 0 = The transferred byte is a data byte 1 = The transferred byte is an address byte</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>ODD</name>
                                        <description>Odd parity is performed, which checks for an odd number of 1s.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EVEN</name>
                                        <description>Even parity generation and checking is performed during transmission and reception, which checks for an even number of 1s in data and parity bits.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>STP2</name>
                            <description>UART Two Stop Bits Select     When in 7816 smart card mode (the SMART bit is set in the UARTCTL register), the number of stop bits is forced to 2.</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>One stop bit is transmitted at the end of a frame.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Two stop bits are transmitted at the end of a frame. The receive logic checks for two stop bits being received and provide Frame Error if either is invalid.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>WLEN</name>
                            <description>UART Word Length  The bits indicate the number of data bits transmitted or received in a frame as follows:</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DATABIT5</name>
                                        <description>5 bits (default)</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DATABIT6</name>
                                        <description>6 bits</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DATABIT7</name>
                                        <description>7 bits</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DATABIT8</name>
                                        <description>8 bits</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>SPS</name>
                            <description>UART Stick Parity Select
The Stick Parity Select (SPS) bit is used to set either a permanent '1' or a permanent '0' as parity when transmitting or receiving data. Its purpose is to typically indicate the first byte of a package or to mark an address byte, for example in a multi-drop RS-485 network.
When bits PEN, EPS, and SPS of UARTLCRH are set, the parity bit is transmitted and checked as a 0. 
When bits PEN and SPS are set and EPS is cleared, the parity bit is transmitted and checked as a 1.</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Disable Stick Parity</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Enable Stick Parity</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>SUSPEND</name>
                            <description>Suspend external communication</description>
                            <bitOffset>0x1A</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Functional mode resumed</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>External communication suspended</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>UC5_UART_STAT</name>
                    <description>UART Status Register</description>
                    <addressOffset>0x1108</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>BUSY</name>
                            <description>UART Busy
			This bit is set as soon as the transmit FIFO/buffer becomes non-empty (regardless of whether UART is enabled) or if a receive data is currently ongoing (after the start edge have been detected until a complete byte, including all stop bits, has been received by the shift register).
In IDLE_Line mode the Busy signal also stays set during the idle time generation.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLEARED</name>
                                        <description>The UART is not busy.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SET</name>
                                        <description>The UART is busy transmitting data. This bit remains set until the complete byte, including all stop bits, has been sent/received from/into the shift register.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TXFF</name>
                            <description>UART Transmit FIFO Full  The meaning of this bit depends on the state of the FEN bit in the CTL0 register.</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLEARED</name>
                                        <description>The transmitter is not full.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SET</name>
                                        <description>transmit FIFO is full.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>RXFF</name>
                            <description>UART Receive FIFO Full</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLEARED</name>
                                        <description>The receiver can receive data.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SET</name>
                                        <description>receive FIFO is full.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TXFE</name>
                            <description>UART Transmit FIFO Empty</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLEARED</name>
                                        <description>The transmitter has data to transmit.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SET</name>
                                        <description>transmit FIFO is empty.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>RXFE</name>
                            <description>UART Receive FIFO Empty</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLEARED</name>
                                        <description>The receiver is not empty.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SET</name>
                                        <description>eceive FIFO is empty.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>RXCLR</name>
                            <description>RX FIFO Clear Status</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLEARED</name>
                                        <description>FIFO is not cleared</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SET</name>
                                        <description>FIFO clear is complete</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TXCLR</name>
                            <description>TX FIFO Clear Status</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLEARED</name>
                                        <description>FIFO is not cleared</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SET</name>
                                        <description>FIFO clear is complete</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
