mspm0-rs/mspm0-data-sources/svd/MSPM0G321X.svd
                <register>
                    <name>UC5_UART_IFLS</name>
                    <description>UART Interrupt FIFO Level Select Register</description>
                    <addressOffset>0x110C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000022</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TXIFLSEL</name>
                            <description>FIFO Level Select for generating events (interrupt/dma). 
Note: for undefined settings the default configuration is used.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>LVL_3_4</name>
                                        <description>TX FIFO &lt;= 3/4 empty</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LVL_1_2</name>
                                        <description>TX FIFO &lt;= 1/2 empty (default)</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LVL_1_4</name>
                                        <description>TX FIFO &lt;= 1/4 empty</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LVL_NOT_FULL</name>
                                        <description>Opposite of full</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LVL_EMPTY</name>
                                        <description>TX FIFO is empty</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LVL_ALMOST_EMPTY</name>
                                        <description>TX FIFO &lt;= 1</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LVL_ALMOST_FULL</name>
                                        <description>TX_FIFO &gt;= (MAX_FIFO_LEN -1)</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>RXIFLSEL</name>
                            <description>FIFO Level Select for generating events (interrupt/dma). 
Note: for undefined settings the default configuration is used.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>LVL_1_4</name>
                                        <description>RX FIFO &gt;= 1/4 full</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LVL_1_2</name>
                                        <description>RX FIFO &gt;= 1/2 full (default)</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LVL_3_4</name>
                                        <description>RX FIFO &gt;= 3/4 full</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LVL_NOT_EMPTY</name>
                                        <description>Opposite of empty</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LVL_FULL</name>
                                        <description>RX FIFO is full</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LVL_ALMOST_FULL</name>
                                        <description>RX_FIFO &gt;= (MAX_FIFO_LEN -1)</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LVL_ALMOST_EMPTY</name>
                                        <description>RX_FIFO &lt;= 1</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TXCLR</name>
                            <description>TX FIFO CLEAR. Setting this bit will clear the TX FIFO contents.</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Disable FIFO clear</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Enable FIFO Clear</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>RXCLR</name>
                            <description>RX FIFO CLEAR. Setting this bit will clear the RX FIFO contents.</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Disable FIFO clear</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Enable FIFO Clear</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>UC5_UART_IBRD</name>
                    <description>UART Integer Baud-Rate Divisor Register</description>
                    <addressOffset>0x1110</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>DIVINT</name>
                            <description>Integer Baud-Rate Divisor</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>UC5_UART_FBRD</name>
                    <description>UART Fractional Baud-Rate Divisor Register</description>
                    <addressOffset>0x1114</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>DIVFRAC</name>
                            <description>Fractional Baud-Rate Divisor</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x6</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>UC5_UART_GFCTL</name>
                    <description>Glitch Filter Control</description>
                    <addressOffset>0x1118</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xfffffffb</resetMask>
                    <fields>
                        <field>
                            <name>DGFSEL</name>
                            <description>Glitch Suppression Pulse Width 
This field controls the pulse width select for glitch suppression on the RX line. 
The value programmed in this field gives the number of cycles of functional clock up to which the glitch has to be suppressed on the RX line.
In IRDA mode:
The minimum pulse length for receive is given by:
t(MIN) = (DGFSEL) / f(IRTXCLK)</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x6</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLED</name>
                                        <description>Bypass GF</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>UC5_UART_TXDATA</name>
                    <description>UART Transmit Data Register</description>
                    <addressOffset>0x1120</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Data Transmitted or Received  Data that is to be transmitted via the UART is written to this field.  When read, this field contains the data that was received by the UART.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>write-only</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>UC5_UART_RXDATA</name>
                    <description>UART Receive Data Register</description>
                    <addressOffset>0x1124</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Received Data.  When read, this field contains the data that was received by the UART.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            </field>
                        <field>
                            <name>FRMERR</name>
                            <description>UART Framing Error  Writing to this bit has no effect. The flag is cleared by writing 1 to the FRMERR bit in the UART EVENT ICLR register. This error is associated with the character at the top of the FIFO.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLR</name>
                                        <description>No framing error has occurred</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SET</name>
                                        <description>The received character does not have a valid stop bit sequence, which is one or two stop bits depending on the UARTLCRH.STP2 setting (a valid stop bit is 1).</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>PARERR</name>
                            <description>UART Parity Error   Writing to this bit has no effect. The flag is cleared by writing 1 to the PARERR bit in the UART EVENT ICLR register.</description>
                            <bitOffset>0x9</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLR</name>
                                        <description>No parity error has occurred</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SET</name>
                                        <description>The parity of the received data character does not match the parity defined by bits 2 and 7 of the UARTLCRH register.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>BRKERR</name>
                            <description>UART Break Error  Writing to this bit has no effect. The flag is cleared by writing 1 to the BRKERR bit in the UART EVENT ICLR register. This error is associated with the character at the top of the FIFO. When a break occurs, only one 0 character is loaded into the FIFO. The next character is only enabled after the receive data input goes to a 1 (marking state) and the next valid start bit is received.</description>
                            <bitOffset>0xA</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLR</name>
                                        <description>No break condition has occurred</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SET</name>
                                        <description>A break condition has been detected, indicating that the receive data input was held low for longer than a full-word transmission time (defined as start, data, parity, and stop bits).</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>NERR</name>
                            <description>Noise Error.
Writing to this bit has no effect. The flag is cleared by writing 1 to the NERR bit in the UART EVENT ICLR register.</description>
                            <bitOffset>0xB</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLR</name>
                                        <description>No noise error occurred</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SET</name>
                                        <description>Noise error occurred during majority voting</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>UC5_UART_LINCNT</name>
                    <description>UART LIN Mode Counter Register</description>
                    <addressOffset>0x1130</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>VALUE</name>
                            <description>16 bit up counter clocked by the functional clock of the UART.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
