mspm0-rs/mspm0-data-sources/svd/MSPM0G321X.svd
bit [0]:	When 1, sector 0 of the engr region will be protected from program
		and erase.
bit [1]:	When 1, sector 1 of the engr region will be protected from program
		and erase.
	:
	:
bit [31]:	When 1, sector 31 of the engr region will be protected from program
		and erase.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>FLASHCTL_CFGCMD</name>
                    <description>Command Configuration Register</description>
                    <addressOffset>0x13B0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>WAITSTATE</name>
                            <description>Wait State setting for verify reads</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>FLASHCTL_CFGPCNT</name>
                    <description>Pulse Counter Configuration Register</description>
                    <addressOffset>0x13B4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>MAXPCNTOVR</name>
                            <description>Override hard-wired maximum pulse count.  If MAXERSPCNTOVR
is not set, then setting this value alone will override the max pulse count for
both program and erase.  If MAXERSPCNTOVR is set, then this bit will only
control the max pulse count setting for program.
By default, this bit is 0, and a hard-wired max pulse count is used.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DEFAULT</name>
                                        <description>Use hard-wired (default) value for maximum pulse count</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>OVERRIDE</name>
                                        <description>Use value from MAXPCNTVAL field as maximum puse count</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>MAXPCNTVAL</name>
                            <description>Override maximum pulse counter with this value.  
If MAXPCNTOVR = 0, then this field is ignored.
If MAXPCNTOVR = 1 and MAXERSPCNTOVR = 0, then this value will be used 
to override the max pulse count for both program and erase.  Full max value
will be {4'h0, MAXPCNTVAL} .
If MAXPCNTOVR = 1 and MAXERSPCNTOVR = 1, then this value will be used
to override the max pulse count for program only.  Full max value will be
{4'h0, MAXPCNTVAL}.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>FLASHCTL_STATCMD</name>
                    <description>Command Status Register</description>
                    <addressOffset>0x13D0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>CMDDONE</name>
                            <description>Command Done</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>STATNOTDONE</name>
                                        <description>Not Done</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>STATDONE</name>
                                        <description>Done</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>CMDPASS</name>
                            <description>Command Pass - valid when CMD_DONE field is 1</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>STATFAIL</name>
                                        <description>Fail</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>STATPASS</name>
                                        <description>Pass</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>CMDINPROGRESS</name>
                            <description>Command In Progress</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>STATCOMPLETE</name>
                                        <description>Complete</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>STATINPROGRESS</name>
                                        <description>In Progress</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>FAILWEPROT</name>
                            <description>Command failed due to Write/Erase Protect Sector Violation</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>STATNOFAIL</name>
                                        <description>No Fail</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>STATFAIL</name>
                                        <description>Fail</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>FAILVERIFY</name>
                            <description>Command failed due to verify error</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>STATNOFAIL</name>
                                        <description>No Fail</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>STATFAIL</name>
                                        <description>Fail</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>FAILMISC</name>
                            <description>Command failed due to error other than write/erase protect violation or verify
error.  This is an extra bit in case a new failure mechanism is added which
requires a status bit.</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>STATNOFAIL</name>
                                        <description>No Fail</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>STATFAIL</name>
                                        <description>Fail</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>FAILILLADDR</name>
                            <description>Command failed due to the use of an illegal address</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>STATNOFAIL</name>
                                        <description>No Fail</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>STATFAIL</name>
                                        <description>Fail</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>FAILMODE</name>
                            <description>Command failed because a bank has been set to a mode other than READ.
Program and Erase commands cannot be initiated unless all banks are in READ
mode.</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>STATNOFAIL</name>
                                        <description>No Fail</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>STATFAIL</name>
                                        <description>Fail</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>FAILINVDATA</name>
                            <description>Program command failed because an attempt was made to program a stored
0 value to a 1.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>STATNOFAIL</name>
                                        <description>No Fail</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>STATFAIL</name>
                                        <description>Fail</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>FLASHCTL_STATADDR</name>
                    <description>Address Status Register</description>
                    <addressOffset>0x13D4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>BANKADDR</name>
                            <description>Current Bank Address
A bank offset address is stored in this register.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            <access>read-only</access>
                            </field>
                        <field>
                            <name>BANKID</name>
                            <description>Current Bank ID
A bank indicator is stored in this register which represents the current bank on
which the state  machine is operating.  There is 1 bit per bank.</description>
                            <bitOffset>0x15</bitOffset>
                            <bitWidth>0x5</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>BANK0</name>
                                        <description>Bank 0</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BANK1</name>
                                        <description>Bank 1</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BANK2</name>
                                        <description>Bank 2</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BANK3</name>
                                        <description>Bank 3</description>
                                        <value>0x8</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BANK4</name>
                                        <description>Bank 4</description>
                                        <value>0x10</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>REGIONID</name>
                            <description>Current Region ID
A region indicator is stored in this register which represents the current flash 
region on which the state  machine is operating.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x5</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>MAIN</name>
                                        <description>Main Region</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>NONMAIN</name>
                                        <description>Non-Main Region</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRIM</name>
                                        <description>Trim Region</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENGR</name>
                                        <description>Engr Region</description>
                                        <value>0x8</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>FLASHCTL_STATPCNT</name>
                    <description>Pulse Count Status Register</description>
                    <addressOffset>0x13D8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>PULSECNT</name>
                            <description>Current Pulse Counter Value</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0xC</bitWidth>
                            <access>read-only</access>
                            </field>
                    </fields>
                </register>
