mspm0-rs/mspm0-data-sources/svd/MSPM0G321X.svd
                <register>
                    <name>SYSCTL_LFCLKCFG</name>
                    <description>Low frequency crystal oscillator (LFXT) configuration</description>
                    <addressOffset>0x1114</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000003</resetValue>
                    <resetMask>0x00000113</resetMask>
                    <fields>
                        <field>
                            <name>XT1DRIVE</name>
                            <description>XT1DRIVE selects the low frequency crystal oscillator (LFXT) drive strength.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>LOWESTDRV</name>
                                        <description>Lowest drive and current</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LOWERDRV</name>
                                        <description>Lower drive and current</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>HIGHERDRV</name>
                                        <description>Higher drive and current</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>HIGHESTDRV</name>
                                        <description>Highest drive and current</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>MONITOR</name>
                            <description>MONITOR enables or disables the LFCLK monitor, which continuously checks LFXT or LFCLK_IN for a clock stuck fault.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Clock monitor is disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Clock monitor is enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>LOWCAP</name>
                            <description>LOWCAP controls the low-power LFXT mode.  When the LFXT load capacitance is less than 3pf, LOWCAP may be set for reduced power consumption.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>LFXT low capacitance mode is disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>LFXT low capacitance mode is enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_SYSPLLCFG0</name>
                    <description>SYSPLL reference and output configuration</description>
                    <addressOffset>0x1120</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000fff73</resetMask>
                    <fields>
                        <field>
                            <name>ENABLECLK0</name>
                            <description>ENABLECLK0 enables or disables the SYSPLLCLK0 output.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>SYSPLLCLK0 is disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>SYSPLLCLK0 is enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>ENABLECLK1</name>
                            <description>ENABLECLK1 enables or disables the SYSPLLCLK1 output.</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>SYSPLLCLK1 is disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>SYSPLLCLK1 is enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>RDIVCLK1</name>
                            <description>RDIVCLK1 sets the final divider for the SYSPLLCLK1 output.</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLK1DIV2</name>
                                        <description>SYSPLLCLK1 is divided by 2</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK1DIV4</name>
                                        <description>SYSPLLCLK1 is divided by 4</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK1DIV6</name>
                                        <description>SYSPLLCLK1 is divided by 6</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK1DIV8</name>
                                        <description>SYSPLLCLK1 is divided by 8</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK1DIV10</name>
                                        <description>SYSPLLCLK1 is divided by 10</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK1DIV12</name>
                                        <description>SYSPLLCLK1 is divided by 12</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK1DIV14</name>
                                        <description>SYSPLLCLK1 is divided by 14</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK1DIV16</name>
                                        <description>SYSPLLCLK1 is divided by 16</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK1DIV18</name>
                                        <description>SYSPLLCLK1 is divided by 18</description>
                                        <value>0x8</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK1DIV20</name>
                                        <description>SYSPLLCLK1 is divided by 20</description>
                                        <value>0x9</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK1DIV22</name>
                                        <description>SYSPLLCLK1 is divided by 22</description>
                                        <value>0xA</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK1DIV24</name>
                                        <description>SYSPLLCLK1 is divided by 24</description>
                                        <value>0xB</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK1DIV26</name>
                                        <description>SYSPLLCLK1 is divided by 26</description>
                                        <value>0xC</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK1DIV28</name>
                                        <description>SYSPLLCLK1 is divided by 28</description>
                                        <value>0xD</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK1DIV30</name>
                                        <description>SYSPLLCLK1 is divided by 30</description>
                                        <value>0xE</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK1DIV32</name>
                                        <description>SYSPLLCLK1 is divided by 32</description>
                                        <value>0xF</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>MCLK2XVCO</name>
                            <description>MCLK2XVCO selects the SYSPLL output which is sent to the HSCLK mux for use by MCLK.</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>The SYSPLLCLK0 output is sent to the HSCLK mux</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>The SYSPLLCLK2X output is sent to the HSCLK mux</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>RDIVCLK2X</name>
                            <description>RDIVCLK2X sets the final divider for the SYSPLLCLK2X output.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLK2XDIV1</name>
                                        <description>SYSPLLCLK1 is divided by 1</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK2XDIV2</name>
                                        <description>SYSPLLCLK1 is divided by 2</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK2XDIV3</name>
                                        <description>SYSPLLCLK1 is divided by 3</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK2XDIV4</name>
                                        <description>SYSPLLCLK1 is divided by 4</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK2XDIV5</name>
                                        <description>SYSPLLCLK1 is divided by 5</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK2XDIV6</name>
                                        <description>SYSPLLCLK1 is divided by 6</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK2XDIV7</name>
                                        <description>SYSPLLCLK1 is divided by 7</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK2XDIV8</name>
                                        <description>SYSPLLCLK1 is divided by 8</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK2XDIV9</name>
                                        <description>SYSPLLCLK1 is divided by 9</description>
                                        <value>0x8</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK2XDIV10</name>
                                        <description>SYSPLLCLK1 is divided by 10</description>
                                        <value>0x9</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK2XDIV11</name>
                                        <description>SYSPLLCLK1 is divided by 11</description>
                                        <value>0xA</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK2XDIV12</name>
                                        <description>SYSPLLCLK1 is divided by 12</description>
                                        <value>0xB</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK2XDIV13</name>
                                        <description>SYSPLLCLK1 is divided by 13</description>
                                        <value>0xC</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK2XDIV14</name>
                                        <description>SYSPLLCLK1 is divided by 14</description>
                                        <value>0xD</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK2XDIV15</name>
                                        <description>SYSPLLCLK1 is divided by 15</description>
                                        <value>0xE</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK2XDIV16</name>
                                        <description>SYSPLLCLK1 is divided by 16</description>
                                        <value>0xF</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>RDIVCLK0</name>
                            <description>RDIVCLK0 sets the final divider for the SYSPLLCLK0 output.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLK0DIV2</name>
                                        <description>SYSPLLCLK0 is divided by 2</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK0DIV4</name>
                                        <description>SYSPLLCLK0 is divided by 4</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK0DIV6</name>
                                        <description>SYSPLLCLK0 is divided by 6</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK0DIV8</name>
                                        <description>SYSPLLCLK0 is divided by 8</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK0DIV10</name>
                                        <description>SYSPLLCLK0 is divided by 10</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK0DIV12</name>
                                        <description>SYSPLLCLK0 is divided by 12</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK0DIV14</name>
                                        <description>SYSPLLCLK0 is divided by 14</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK0DIV16</name>
                                        <description>SYSPLLCLK0 is divided by 16</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK0DIV18</name>
                                        <description>SYSPLLCLK0 is divided by 18</description>
                                        <value>0x8</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK0DIV20</name>
                                        <description>SYSPLLCLK0 is divided by 20</description>
                                        <value>0x9</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK0DIV22</name>
                                        <description>SYSPLLCLK0 is divided by 22</description>
